ninety_nine_cats_ii/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "session_token", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "smiles"], ["password_digest", "$2a$10$A.PVzC3iGtrngFKMxCvXJuaDbx3IL6Kzc2tNV7M2w9sdETRfEBBv6"], ["updated_at", "2018-09-12 23:12:45.822263"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)